<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"75d8e5838e920aec675482892c5c04043a703b7c100c466d3f30d5abec06dd1a","plan_job_ref":"Job Plan org changes and list them in a PR #26 at https://github.com/django-commons/controls/actions/runs/10079489920","plan_out_hash":"b5119e747b3d495881039a7da40f4156b912c6eeba16a8c21ad52bf334be18bf","plan_hash":"55b63683cbd2f33b47bc4d41b2643df6be4e2d555437166b48e7aa3398f6f1d2","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 4 to add, 9 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_organization_security_manager.this will be created
+   resource "github_organization_security_manager" "this" {
+       id        = (known after apply)
+       team_slug = (known after apply)
    }

  # github_repository.this[".github"] will be updated in-place
!~  resource "github_repository" "this" {
+       archive_on_destroy          = true
!~      delete_branch_on_merge      = false -> true
+       description                 = "A Special Repository."
!~      has_discussions             = false -> true
!~      has_wiki                    = true -> false
        id                          = ".github"
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
        name                        = ".github"
+       squash_merge_commit_message = "BLANK"
+       squash_merge_commit_title   = "PR_TITLE"
!~      vulnerability_alerts        = false -> true
#        (27 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_repository.this["controls"] will be updated in-place
!~  resource "github_repository" "this" {
+       archive_on_destroy          = true
!~      delete_branch_on_merge      = false -> true
!~      has_discussions             = false -> true
!~      has_wiki                    = true -> false
        id                          = "controls"
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
        name                        = "controls"
+       squash_merge_commit_message = "BLANK"
+       squash_merge_commit_title   = "PR_TITLE"
!~      vulnerability_alerts        = false -> true
#        (28 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_repository.this["django-commons-playground"] will be updated in-place
!~  resource "github_repository" "this" {
+       archive_on_destroy          = true
!~      delete_branch_on_merge      = false -> true
!~      has_discussions             = false -> true
!~      has_wiki                    = true -> false
        id                          = "django-commons-playground"
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-commons-playground"
+       squash_merge_commit_message = "BLANK"
+       squash_merge_commit_title   = "PR_TITLE"
!~      vulnerability_alerts        = false -> true
#        (28 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_repository.this["membership"] will be updated in-place
!~  resource "github_repository" "this" {
+       archive_on_destroy          = true
!~      delete_branch_on_merge      = false -> true
+       description                 = "Membership repository for the django-commons organization."
!~      has_wiki                    = true -> false
        id                          = "membership"
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
        name                        = "membership"
+       squash_merge_commit_message = "BLANK"
+       squash_merge_commit_title   = "PR_TITLE"
!~      vulnerability_alerts        = false -> true
#        (28 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_team.org_teams["Admins"] will be updated in-place
!~  resource "github_team" "org_teams" {
+       description               = "django-commons administrators"
        id                        = "9763562"
        name                      = "Admins"
#        (10 unchanged attributes hidden)
    }

  # github_team.org_teams["security-team"] will be created
+   resource "github_team" "org_teams" {
+       create_default_maintainer = false
+       description               = "django-commons security team"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "security-team"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_admin_team["django-commons-playground"] will be updated in-place
!~  resource "github_team" "repo_admin_team" {
+       description               = "Admin team for the django-commons-playground repository"
        id                        = "9757650"
        name                      = "django-commons-playground-admins"
#        (10 unchanged attributes hidden)
    }

  # github_team.repo_committer_team["django-commons-playground"] will be updated in-place
!~  resource "github_team" "repo_committer_team" {
+       description               = "Committers team for the django-commons-playground repository"
        id                        = "9757668"
        name                      = "django-commons-playground-committers"
#        (10 unchanged attributes hidden)
    }

  # github_team.repo_team["django-commons-playground"] will be updated in-place
!~  resource "github_team" "repo_team" {
+       description               = "Main team for the django-commons-playground repository"
        id                        = "9757678"
        name                      = "django-commons-playground"
#        (10 unchanged attributes hidden)
    }

  # github_team_members.org_team_members["security-team"] will be created
+   resource "github_team_members" "org_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "matthiask"
        }
+       members {
+           role     = "maintainer"
+           username = "tim-schilling"
        }
    }

  # github_team_members.repo_team_members["django-commons-playground"] will be updated in-place
!~  resource "github_team_members" "repo_team_members" {
        id      = "9757678"
#        (1 unchanged attribute hidden)

-       members {
-           role     = "maintainer" -> null
-           username = "Stormheg" -> null
        }
-       members {
-           role     = "maintainer" -> null
-           username = "cunla" -> null
        }
-       members {
-           role     = "maintainer" -> null
-           username = "ryancheley" -> null
        }
-       members {
-           role     = "maintainer" -> null
-           username = "tim-schilling" -> null
        }
-       members {
-           role     = "maintainer" -> null
-           username = "williln" -> null
        }
+       members {
+           role     = "member"
+           username = "Stormheg"
        }
+       members {
+           role     = "member"
+           username = "cunla"
        }
+       members {
+           role     = "member"
+           username = "ryancheley"
        }
+       members {
+           role     = "member"
+           username = "tim-schilling"
        }
+       members {
+           role     = "member"
+           username = "williln"
        }

#        (1 unchanged block hidden)
    }

  # github_team_settings.this["django-commons-playground"] must be replaced
-/+ resource "github_team_settings" "this" {
!~      id        = "******************" -> (known after apply)
!~      team_id   = "django-commons-playground" -> "9757678" # forces replacement
!~      team_slug = "django-commons-playground" -> (known after apply)
!~      team_uid  = "T_kwDOCaaRBM4AlOPu" -> (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 4 to add, 9 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #26](https://github.com/django-commons/controls/actions/runs/10079489920)